import { equals } from "ramda";

const AssetsURL = equals(process.env.NODE_ENV, "production")
  ? "https://www.forestmis.com/assets"
  : "https://www.forestmis.com/assets";

const SPECIALOPTIONS = {
  ALL: -1, // Select All
  NONE: -2, // Select None
  SELFASSIGNED: -3,
  LIST: -4, // List
};

const samudayikbanHeadings = [
  "दर्ता नं",
  "सामुदायिक वन उपभोक्ता समितिको नाम",
  "क्षत्रफल(हे.)",
  "मुख्य प्रजाति",
  "वनको किसिम(प्राकृतिक्/वृक्षरोपण)",
  "हस्तान्तरण मिति",
  "नविकरण गरेको मिती",
  "नविकरण अबधि ",
  "वनको मौज्दात",
  "वार्षिक निकासी परिमाण (घ. मी)काठ",
  "वार्षिक निकासी परिमाण (घ. मी)दाउरा",
  "नविकरण गर्नुपर्ने आर्थिक बर्ष",
  "सिर्जना गर्ने",
  "परिमार्जन गर्ने",
];
const dharmikbanHeadings = [
  "दर्ता नं",
  "धर्मिक वनको नाम",
  "व्यवस्थापन गर्ने धार्मिक निकाय / समुदायको नाम",
  "क्षत्रफल(हे.)",
  "मुख्य प्रजाति",
  "वनको किसिम(प्राकृतिक्/वृक्षरोपण)",
  "हस्तान्तरण मिति",
  "नविकरण गरेको मिती",
  "नविकरण अबधि ",
  "वनको मौज्दात(घ.मी.)",
  "नविकरण गर्नुपर्ने आर्थिक वर्ष",
  "सिर्जना गर्ने",
  "परिमार्जन गर्ने",
];
const kabuliyatibanHeadings = [
  "दर्ता नं",
  "दर्ता मिति",
  "सामुदायिक वन उपभोक्ता समितिको नाम",
  "ठेगाना साविक",
  "ठेगाना हाल",
  "दलित घरधुरी",
  "जनजाति घरधुरी",
  "अन्य घरधुरी",
  "जम्मा घरधुरी",
  "महिला जनसंख्या",
  "पुरुष जनसंख्या",
  "जम्मा जनसंख्या",
  "सम्पन्न ",
  "मध्यम",
  "विपन्न",
  "कार्यसमितिमा दलित प्रतिनिधित्व",
  "कार्यसमितिमा जनजाति प्रतिनिधित्व",
  "कार्यसमितिमा अन्य प्रतिनिधित्व",
  "मुख्य पदाधिकारीमा प्रतिनिधित्व(महिला अध्यक्ष)",
  "मुख्य पदाधिकारीमा प्रतिनिधित्व(पुरुष अध्यक्ष)",
  "मुख्य पदाधिकारीमा प्रतिनिधित्व(महिला सचिव)",
  "मुख्य पदाधिकारीमा प्रतिनिधित्व(पुरुष सचिव)",
  "सिर्जना गर्ने",
  "परिमार्जन गर्ने",
];
const nijibanHeadings = [
  "दर्ता नं",
  "स्विकृत मिति",
  "नीजि वन धनिको नाम",
  "साविक ठेगाना",
  "हालको ठेगाना",
  "क्षत्रफल(हे.)",
  "वनका मुख्य तथा सहायक प्रजातिहरु",
  "सिर्जना गर्ने",
  "परिमार्जन गर्ने",
];

const biruwautpadanHeadings = [
  "आर्थिक वर्ष",
  "नर्सरी संख्या",
  "वर्ग",
  "लक्ष",
  "प्रगति",
  "वृक्षरोपण",
  "कैफियत",
  "सिर्जना गर्ने",
  "परिमार्जन गर्ने",
];

const yearlyactivitiesHeadings = [
  "सामुदायिक वन नाम",
  "आर्थिक वर्ष",
  "सम्बर्धन गरिएको क्षेत्रफल",
  "सम्बर्धनबाट उत्पादन काठ पारिमाण (क्यू. फि.)",
  "सम्बर्धनबाट उत्पादन दाउरा पारिमाण (क्यू. फि.)",
  "वन सम्बर्धन कार्यबाट रोजगारीको श्रृजना संख्या (श्रम दिन)",
  "समूहभित्र काठ वितरण (क्यू. फि.)",
  "समूहभित्र दाउरा वितरण (भारी)",
  "समूहबाहिर काठ वितरण (क्यू. फि.)",
  "समूहबाहिर दाउरा वितरण (चट्ट)",
  "मौज्दात काठ (क्यू. फि.)",
  "मौज्दात दाउरा (चट्ट))",
  "वार्षिक आम्दानी (रु)",
  "वार्षिक खर्च (रु)",
  "खुद वचत खुद आम्दानी (रु)",
  "सामूहमा नियमित रोजगार संख्या(जना)",
  "समूहले संचालन गरेको उद्यमको विवरण",
  "वार्षिक प्रतिवेदन (बुझाएको/नबुझाएको)",
  "लेखा परिक्षण (गरेको/नगरेको)",
  "सिर्जना गर्ने",
  "परिमार्जन गर्ने",

];

const banpaidawarlilamHeadings = [
  "लिलाम मिति",
  "वन पैदावारको किसिम",
  "इकाई",
  "परिमाण",
  "न्युनतम मूल्य (रु)",
  "सकार रकम (रु)",
  "कैफियत",
  "सिर्जना गर्ने",
  "परिमार्जन गर्ने",
];

export {
  AssetsURL,
  SPECIALOPTIONS,
  samudayikbanHeadings,
  dharmikbanHeadings,
  kabuliyatibanHeadings,
  nijibanHeadings,
  biruwautpadanHeadings,
  yearlyactivitiesHeadings,
  banpaidawarlilamHeadings,
};
