import { equals } from "ramda";

const AssetsURL = equals(process.env.NODE_ENV, "production")
  ? "https://www.forestmis.com/assets"
  : "https://www.forestmis.com/assets";

const SPECIALOPTIONS = {
  ALL: -1, // Select All
  NONE: -2, // Select None
  SELFASSIGNED: -3,
  LIST: -4, // List
};

const samudayikbanHeadings = [
  "दर्ता नं",
  "सामुदायिक वन उपभोक्ता समितिको नाम",
  "क्षेत्रफल(हे.)",
  "मुख्य प्रजाति",
  "वनको किसिम(प्राकृतिक्/वृक्षरोपण)",
  "दलित घरधुरी",
  "जनजाति घरधुरी",
  "अन्य घरधुरी",
  "महिला जनसंख्या",
  "पुरुष जनसंख्या",
  "हस्तान्तरण मिति",
  "नविकरण गरेको मिती",
  "नविकरण अबधि ",
  "वनको मौज्दात",
  "वार्षिक निकासी परिमाण (घ. मी)काठ",
  "वार्षिक निकासी परिमाण (घ. मी)दाउरा",
  "वैज्ञानीक वन व्यबस्थापन (स्विकृती अवस्था)",
  "नविकरण गर्नुपर्ने आर्थिक बर्ष",
];
const dharmikbanHeadings = [
  "दर्ता नं",
  "धर्मिक वनको नाम",
  "व्यवस्थापन गर्ने धार्मिक निकाय / समुदायको नाम",
  "क्षेत्रफल(हे.)",
  "मुख्य प्रजाति",
  "वनको किसिम(प्राकृतिक्/वृक्षरोपण)",
  "दलित घरधुरी",
  "जनजाति घरधुरी",
  "अन्य घरधुरी",
  "महिला जनसंख्या",
  "पुरुष जनसंख्या",
  "हस्तान्तरण मिति",
  "नविकरण गरेको मिती",
  "नविकरण अबधि ",
  "वनको मौज्दात(घ.मी.)",
  "नविकरण गर्नुपर्ने आर्थिक वर्ष",
];
const kabuliyatibanHeadings = [
  "दर्ता नं",
  "दर्ता मिति",
  "कवुलियती वन उपभोक्ता समितिको नाम",
  "क्षेत्रफल(हे.)",
  "ठेगाना साविक",
  "ठेगाना हाल",
  "दलित घरधुरी",
  "जनजाति घरधुरी",
  "अन्य घरधुरी",
  "महिला जनसंख्या",
  "पुरुष जनसंख्या",
  "सम्पन्न ",
  "मध्यम",
  "विपन्न",
  "कार्यसमितिमा दलित प्रतिनिधित्व",
  "कार्यसमितिमा जनजाति प्रतिनिधित्व",
  "कार्यसमितिमा अन्य प्रतिनिधित्व",
  "मुख्य पदाधिकारीमा प्रतिनिधित्व अध्यक्ष",
  "अध्यक्ष (लिङ्ग)",
  "मुख्य  पदाधिकारीमा प्रतिनिधित्व  सचिव",
  "सचिव (लिङ्ग)",
];
const nijibanHeadings = [
  "दर्ता नं",
  "स्विकृत मिति",
  "नीजि वन धनिको नाम",
  "साविक ठेगाना",
  "हालको ठेगाना",
  "क्षेत्रफल(हे.)",
  "दलित घरधुरी",
  "जनजाति घरधुरी",
  "अन्य घरधुरी",
  "महिला जनसंख्या",
  "पुरुष जनसंख्या",
  "वनका मुख्य तथा सहायक प्रजातिहरु",
];
const sajhedaribanHeadings = [
  "दर्ता नं",
  "दर्ता मिति",
  "साझेदारीवनको नाम",
  "ठेगाना",
  "क्षेत्रफल",
  "मूख्य प्रजाति",
  "दलित घरधुरी",
  "जनजाति घरधुरी",
  "अन्य घरधुरी",
  "महिला जनसंख्या",
  "पुरुष जनसंख्या",
];

const chaklabanHeadings = [
  "दर्ता नं",
  "दर्ता मिति",
  "चक्लावनको नाम",
  "ठेगाना",
  "क्षेत्रफल",
  "मूख्य प्रजाति",
  "दलित घरधुरी",
  "जनजाति घरधुरी",
  "अन्य घरधुरी",
  "महिला जनसंख्या",
  "पुरुष जनसंख्या",
];

const rastriyabanHeadings = [
  "दर्ता नं",
  "दर्ता मिति",
  "राष्ट्रिय वनको नाम",
  "ठेगाना",
  "क्षेत्रफल",
  "मूख्य प्रजाति",
  "दलित घरधुरी",
  "जनजाति घरधुरी",
  "अन्य घरधुरी",
  "महिला जनसंख्या",
  "पुरुष जनसंख्या",
];
const upabhoktasamuhaHeadings = [
  "दर्ता नं",
  "दर्ता मिति",
  "सामुदायिक वन उपभोक्ता समितिको नाम",
  "साविक ठेगाना",
  "हाल ठेगाना",
  "दलित घरधुरी",
  "जनजाती घरधुरी",
  "अन्य घरधुरी",
  "महिला जनसंख्या",
  "पुरुष जनसंख्या",
  "सम्पन्नता स्तरीकरण घरधुरी (सम्पन्न)",
  "सम्पन्नता स्तरीकरण घरधुरी (मध्यम)",
  "सम्पन्नता स्तरीकरण घरधुरी (विपन्न)",
  "कार्यसमितिमा प्रतिनिधित्व (दलित)",
  "कार्यसमितिमा प्रतिनिधित्व (जनजाती)",
  "कार्यसमितिमा प्रतिनिधित्व (अन्य)",
  "मुख्य  पदाधिकारीमा प्रतिनिधित्व  अध्यक्ष",
  "अध्यक्ष (लिङ्ग)",
  "मुख्य  पदाधिकारीमा प्रतिनिधित्व  सचिव",
  "सचिव (लिङ्ग)",
];

const commercialbanHeadings = [
  "दर्ता नं",
  "दर्ता मिति",
  "व्यवसायीक कबुलियति वनको नाम",
  "ठेगाना",
  "क्षेत्रफल",
  "मूख्य प्रजाति",
  "दलित घरधुरी",
  "जनजाति घरधुरी",
  "अन्य घरधुरी",
  "महिला जनसंख्या",
  "पुरुष जनसंख्या",
];

const biruwautpadanHeadings = [
  "आर्थिक वर्ष",
  "नर्सरी संख्या",
  "वर्ग",
  "लक्ष",
  "प्रगति",
  "वृक्षरोपण",
  "कैफियत",
];

const yearlyactivitiesHeadings = [
  "सामुदायिक वन नाम",
  "आर्थिक वर्ष",
  "सम्बर्धन गरिएको क्षेत्रफल",
  "सम्बर्धनबाट उत्पादन काठ पारिमाण (क्यू. फि.)",
  "सम्बर्धनबाट उत्पादन दाउरा पारिमाण (क्यू. फि.)",
  "वन सम्बर्धन कार्यबाट रोजगारीको श्रृजना संख्या (श्रम दिन)",
  "समूहभित्र काठ वितरण (क्यू. फि.)",
  "समूहभित्र दाउरा वितरण (भारी)",
  "समूहबाहिर काठ वितरण (क्यू. फि.)",
  "समूहबाहिर दाउरा वितरण (चट्ट)",
  "मौज्दात काठ (क्यू. फि.)",
  "मौज्दात दाउरा (चट्ट))",
  "वार्षिक आम्दानी (रु)",
  "वार्षिक खर्च (रु)",
  "खुद वचत खुद आम्दानी (रु)",
  "सामूहमा नियमित रोजगार संख्या(जना)",
  "समूहले संचालन गरेको उद्यमको विवरण",
  "वार्षिक प्रतिवेदन (बुझाएको/नबुझाएको)",
  "लेखा परिक्षण (गरेको/नगरेको)",
];

const banpaidawarlilamHeadings = [
  "लिलाम मिति",
  "वन पैदावारको किसिम",
  "इकाई",
  "परिमाण",
  "न्युनतम मूल्य (रु)",
  "सकार रकम (रु)",
  "कैफियत",
];

const banpaidawarosarpasarHeadings = [
  "आर्थिक वर्ष",
  "महिना",
  "वन पैदावार काठ (क्यू. फि.)",
  "वन पैदावार दाउरा (चट्टा)",
  "लाभग्राही संख्या",
  "प्राप्त मूल्य अभिवृध्दि कर (रु)",
];

const bandadeloHeadings = [
  "वन डढेलो लागेको ठेगाना",
  "राष्ट्रिय/सामुदायिक वन/धार्मिक वन",
  "वनको मुख्य प्रजाति",
  "क्षति क्षेत्रफल (हे.)",
  "समूहबाट नियन्त्रणका लागि भएका प्रयासहरु",
  "समूह तथा डिभिजन वन कार्यलय/प्रहरी/अन्य क्षेत्रबाट भएका प्रयासहरु",
  "नियन्त्रणमा सहभागि महिला संख्या",
  "नियन्त्रणमा सहभागि पुरुष संख्या",
  "डढेलो लागेको मिति",
];

const banyajantuuddarHeadings = [
  "मिति",
  "स्थानिय तह",
  "समय",
  "संरक्षित क्षेत्र/सा.व.क्षेत्र",
  "वन्यजन्तुको नाम",
  "उमेर",
  " अवस्था (मृत,जिउॅदो)",
  "मरेको भए कारण",
  "नजिकको वन क्षेत्रबाट दुरी(मि.)",
  "अन्य विवरण",
  "कैफियत",
];

const banyajantuxetirahatHeadings = [
  "पिडितको नाम",
  "पिडितको ठेगाना",
  "जग्गाको विवरण",
  "नागरिकता न.",
  "सम्बन्धी उपभोक्ता समितिको नाम",
  "क्षती गर्ने वन्यजन्तुको नाम",
  "क्षतिको मिति",
  "पशुधन/घरगोठ",
  "मानविय क्षति(सामान्य घाइते, गम्भीर घाइते, मृत्यु )",
  "माग रकम",
  "समितिको मूल्यांकन रकम(रु)",
  "भुक्तानि रकम(रु)",
  "कैफियत",
];
const gharjaggaHeadings = [
  "किसिम (घर, जग्गा, सवारी साधानहरु)",
  "घर/जग्गा रहेको स्थान",
  "कित्ता नंवर",
  "घरले चर्चेको क्षेत्रफल",
  "जग्गाको क्षेत्रफल",
  "इकाई",
  "कैफियत",
];

const sawarisadhanHeadings = [
  "सवारी साधनको प्रकार",
  "सवारी नम्वर",
  "इन्जिन नं.",
  "च्यासिस नं.",
  "प्राप्ति स्रोत",
  "प्राप्ति मिति",
  "प्राप्ति मूल्य",
  "निर्माता देश",
  "निर्माता कम्पनी",
  "मोडेलको नाम",
  "निर्माण वर्ष",
  "कैफियत (अवस्था)",
];
const banxetraatikramanHeadings = [
  "अतिक्रमित वनको क्षेत्रफल",
  "ठेगाना",
  "किसिम (संस्थागत / व्यक्तिगत)",
  "दलित घरधुरी",
  "जनजाति घरधुरी",
  "अन्य घरधुरी",
  "अतिक्रमण मिति",
  "अतिक्रमण प्रयोजन (घरछाप्रो, खेती, पूर्वाधार निर्माण)",
  "संरचना वनेको भए संरचना विवरण",
  "अतिक्रमित अवस्था (नयाँ वा पुरानो)",
];
const seedgardenplotsHeadings = [
  "प्लटको किसिम",
  "प्रजातिहरु",
  "क्षेत्रफल",
  "ठेगाना",
  "स्थापना मिति",
  "अवस्था",
];
const banxetraanyaprayojanHeadings = [
  "आर्थिक वर्ष",
  "वन क्षेत्र उपलब्ध गराएको संस्था/आयोजनाको नाम",
  "वन उपलब्ध गराएको ठेगाना सामुदायीक वन/ कबुलियति वन/ गाउँपालिका/ नगरपालिका",
  "अस्थायी प्रयोजनको लागि उपलब्ध गराएको जग्गाको क्षेत्रफल (हे)",
  "स्थायी प्रयोजनको लागि उपलब्ध गराएको जग्गाको क्षेत्रफल (हे)",
  "समयावधी",
  "हटाउनु पर्ने रुख संख्या",
  "हटाएको रुख संख्या",
  "सट्टा भर्नावापत उपलब्ध गराएको जग्गाको क्षेत्रफल (हे.)",
  "क्षतिपूर्ति वृक्षरोपण प्रजाति",
  "सट्टा भर्ना जग्गामा वृक्षरोपण प्रजाति",
  "लिज रकम अध्यावधिक गरेको नगरेको",
  "वार्षिक प्रतिवेदन पेश गरेको नगरेको",
  "प्राप्त राजश्व (रु)",
];

const muddaanusandhandayariHeadings = [
  "जाहेरी प्रतिवेदन मिति",
  "कसुरको किसिम",
  "विगो भए विगो परिमाण (रु)",
  // "वरमादित काठ (क्यू. फि.)",
  // "वरमादित दाउरा (चट्ट)",
  // "वरमादित आखेटोपहार (गोटा)",
  // "वरमादित ढुङ्गा (घ. मि.)",
  // "वरमादित वोझवाहक",
  "अतिक्रमित जग्गाको क्षेत्रफल",
  "अतिक्रमित जग्गाको ठेगाना",
  "अभियोग पत्र दायर भएको मिति",
  "अभियोग पत्र दायर भएको निकाय",
  "अभियोग मागदावी जरीवाना (रु)",
  "अभियोग मागदावी कैद (वर्ष)",
  "वोझ वाहक जफत माग दावी (लिएको वा नलिएको)",
  "प्रतिवादी संख्या (जना)",
  "थुनछेक आदेश-धरौटी (रु)",
  "थुनछेक आदेश-साधारण तारेख",
  "थुनछेक आदेश-थुना आदेश",
  "फैसला मिति",
  "फैसला जरीवाना",
  "फैसला कैद",
  "वोझ वाहक जफत (भएको वा नभएको)",
];

const brixyaropanHeadings = [
  "वृक्षरोपण ठेगाना",
  "वृक्षरोपण किसिम",
  "लक्ष",
  "वृक्षरोपण प्रजाति",
  "प्रगति",
  "वृक्षरोपण संख्या",
];
const districtList = [
  { id: "%", value: "सबै" },
  { id: 1, value: "कास्की" },
  { id: 2, value: "गोरखा" },
  { id: 3, value: "तनहुँ" },
  { id: 4, value: "नवलपरासी (बर्दघाट सुस्ता पूर्व)" },
  { id: 5, value: "पर्वत" },
  { id: 6, value: "बाग्लुङ" },
  { id: 7, value: "मनाङ" },
  { id: 8, value: "मुस्ताङ" },
  { id: 9, value: "म्याग्दी" },
  { id: 10, value: "लमजुङ" },
  { id: 11, value: "स्याङजा" },
];

const karmacharidarbandiHeadings = [
  "पद",
  "कायम दरबन्दी संख्या",
  "पदपुर्ति संख्या",
  "खाली संख्या",
];

const karmacharibibaranHeadings = [
  "नाम",
  "स्थायी प्रदेश",
  "स्थायी जिल्ला",
  "स्थायी नगरपालिका",
  "स्थायी वडा न.",
  "स्थायी टोल",
  "अस्थायी प्रदेश",
  "अस्थायी जिल्ला",
  "अस्थायी नगरपालिका",
  "अस्थायी वडा न.",
  "अस्थायी टोल",
  "सम्पर्क न.",
  "इमेल",
  "कार्यालय",
  "विभाग",
  "स्तर",
  "पोष्ट",
  "श्रेणी",
  "अपोइन्ट मिति",
  "स्थिति",
];

const jadibutiHeadings = [
  "जडिबुटी उत्पादन ठेगाना",
  "जडिबुटीको किसिम",
  "जडिबुटीको प्रजाति",
  "लक्ष",
  "प्रगति",
  "जडिबुटी संख्या",
];

const banbikaskaryabibaranHeadings = [
  "वनविकास कार्याविवरण",
  "ईकाइ",
  "परिणाम",
  "बजेट खर्च",
  "वनको किसिम",
];

const samajikkaryabibaranHeadings = [
  "सामाजिक कार्याविवरण",
  "इकाई",
  "परिणाम",
  "बजेट खर्च",
  "वनको किसिम",
];

const rojgarsrijanaHeadings = [
  "कार्यहरु",
  "इकाई",
  "वनका प्रकार",
  "महिला",
  "पुरुष",
  "जम्मा",
  "कैफियत",
];

const pahirobebasthapanHeadings = [
  "पहिरो गएको मिति",
  "पहिरो गएको स्थान",
  "उद्दार संख्या",
  "घाइते मानव संख्या",
  "मृत मानव संख्या",
  "क्षेति विवरण",
  "मर्ने वन्यजन्तु संख्या",
  "बोटविरुवा क्षेति संख्या",
];

const badibebasthapanHeadings = [
  "बाढी आएको मिति",
  "बाढी आएको स्थान",
  "उद्दार संख्या",
  "घाइते मानव संख्या",
  "मृत मानव संख्या",
  "क्षेति विवरण",
  "मर्ने वन्यजन्तु संख्या",
  "बोटविरुवा क्षेति संख्या",
];

const nadikinarsamrakshyanHeadings = [
  "स्थान",
  "परिमाण",
  "कार्यक्रम मिति",
  "संरक्षण क्षेत्र",
  "प्रभावित क्षेत्र",
];

const pokharisamrakshyanHeadings = [
  "पालिका",
  "परिमाण",
  "कार्यक्रम मिति",
  "लागात",
];
const panimuhansamrakshyanHeadings = [
  "स्थान",
  "परिमाण",
  "कार्यक्रम मिति",
  "लागात",
];

const jaladharsamrakshyanHeadings = [
  "स्थान",
  "परिमाण",
  "कार्यक्रम मिति",
  "लागात",
];

const banpaidawarbikribitaranHeadings = [
  "बिक्रि मिति",
  "वनपैदावार किसिम",
  "इकाई",
  "आन्तरीक दर",
  "आन्तरीक पारिमाण",
  "आन्तरीक रकम",
  "आपुर्ती दर",
  "आपुर्ती पारिमाण",
  "आपुर्ती रकम",
  "वाह्य दर",
  "वाह्य परिमाण",
  "वाह्य रकम",
];

export {
  AssetsURL,
  SPECIALOPTIONS,
  samudayikbanHeadings,
  dharmikbanHeadings,
  kabuliyatibanHeadings,
  nijibanHeadings,
  biruwautpadanHeadings,
  yearlyactivitiesHeadings,
  banpaidawarlilamHeadings,
  banpaidawarosarpasarHeadings,
  bandadeloHeadings,
  banyajantuuddarHeadings,
  banyajantuxetirahatHeadings,
  gharjaggaHeadings,
  sawarisadhanHeadings,
  banxetraatikramanHeadings,
  seedgardenplotsHeadings,
  banxetraanyaprayojanHeadings,
  muddaanusandhandayariHeadings,
  brixyaropanHeadings,
  karmacharidarbandiHeadings,
  districtList,
  karmacharibibaranHeadings,
  jadibutiHeadings,
  sajhedaribanHeadings,
  chaklabanHeadings,
  rastriyabanHeadings,
  commercialbanHeadings,
  upabhoktasamuhaHeadings,
  banbikaskaryabibaranHeadings,
  samajikkaryabibaranHeadings,
  rojgarsrijanaHeadings,
  pahirobebasthapanHeadings,
  badibebasthapanHeadings,
  nadikinarsamrakshyanHeadings,
  pokharisamrakshyanHeadings,
  jaladharsamrakshyanHeadings,
  panimuhansamrakshyanHeadings,
  banpaidawarbikribitaranHeadings,
};
